Revit 2027 API
RebarUpdateCurvesData.IsCustomSpacingFormulaChanged Property
 Indicates if the custom formula has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCustomSpacingFormulaChanged { get; }
Public ReadOnly Property IsCustomSpacingFormulaChanged As Boolean
	Get
public:
property bool IsCustomSpacingFormulaChanged {
	bool get ();
}
member IsCustomSpacingFormulaChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace